📚 docs(misc): Re-organize stuff to clarify next steps
