--- a/docs/blog/posts/2022/2022-01-20-design-patterns--factory-method.md
+++ b/docs/blog/posts/2022/2022-01-20-design-patterns--factory-method.md
@@ -82,145 +82,123 @@ Martin a donc :
 - Il va lui-même assembler l'ordinateur de jeu pour Alice (car ça l'amuse)
 - Il va acheter un ordinateur de seconde main à une `Brocante` pour l'ordinateur de bureautique
 
-```plantuml format="svg" alt="Martin passe par une brocante pour fournir un ordinateur de bureautique à Omar, et cosntruit lui-même l'ordinateur de jeu d'Alice, mais en suivant le pattern de la Factory Method"
-class "Fournisseur d'ordinateurs" {
-   Ordinateur +récupérerOrdinateur()
-   OrdinateurDeJeu +récupérerOrdinateurDeJeu()
-   OrdinateurDeBureautique +récupérerOrdinateurDeBureautique()
-}
 
-class "Martin" {
-   Ordinateur +récupérerOrdinateur()
-   OrdinateurDeJeu +récupérerOrdinateurDeJeu()
-}
+```mermaid
+classDiagram
+    class FournisseurDOrdinateurs {
+        Ordinateur +obtenirOrdinateur()
+        OrdinateurDeJeu +obtenirOrdinateurDeJeu()
+        OrdinateurDeBureautique +obtenirOrdinateurDeBureautique()
+    }
+    class Martin {
+        Ordinateur +obtenirOrdinateur()
+        OrdinateurDeJeu +obtenirOrdinateurDeJeu()
+    }
+    class Brocante {
+        OrdinateurDeBureautique +obtenirOrdinateurDeBureautique()
+    }
+    class Ordinateur
+    class OrdinateurArtisanal
+    class OrdinateurDeJeu
+    class OrdinateurDeJeuArtisanal
+    class OrdinateurDeBureautique
+    class OrdinateurDeBureautiqueDeSecondeMain
 
-class "Brocante" {
-   OrdinateurDeBureautique +récupérerOrdinateurDeBureautique()
-}
+    FournisseurDOrdinateurs <|-- Martin
+    FournisseurDOrdinateurs<|-- Brocante
+    Ordinateur <|-- OrdinateurArtisanal
+    Ordinateur <|-- OrdinateurDeJeu
+    OrdinateurDeJeu <|-- OrdinateurDeJeuArtisanal
+    Ordinateur <|-- OrdinateurDeBureautique
+    OrdinateurDeBureautique <|-- OrdinateurDeBureautiqueDeSecondeMain
+    Martin --> OrdinateurArtisanal
+    Martin --> OrdinateurDeJeuArtisanal
+    Brocante --> OrdinateurDeBureautiqueDeSecondeMain
 
-"Fournisseur d'ordinateurs" <|-- Martin
-"Fournisseur d'ordinateurs" <|-- Brocante
-Ordinateur <|-- "Ordinateur Artisanal"
-Ordinateur <|-- "OrdinateurDeJeu"
-OrdinateurDeJeu <|-- "OrdinateurDeJeu Artisanal" 
-Ordinateur <|-- "OrdinateurDeBureautique"
-OrdinateurDeBureautique <|-- "OrdinateurDeBureautique de seconde main"
-Martin .>  "Ordinateur Artisanal"
-Martin .>  "OrdinateurDeJeu Artisanal"
-Brocante .>  "OrdinateurDeBureautique de seconde main"
-
-Ordinateur -() Martin
-Ordinateur -() Jacques
-OrdinateurDeJeu -() Alice
-Ordinateur -() Elie
-OrdinateurDeBureautique -() Omar
-
-hide circle
+    Ordinateur -- Martin
+    Ordinateur -- Jacques
+    OrdinateurDeJeu -- Alice
+    Ordinateur -- Elie
+    OrdinateurDeBureautique -- Omar
 ```
-
 
 ## A quoi ça sert ?
